//Найти максимальное из трех чисел
Console.WriteLine("Введите 3 целых числа от 1 до 9: ");
string numbers = Console.ReadLine();

