//Задача 2: Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
//4 -> да, -3 -> нет, 7 -> нет

int a = 4;
int b = -3;
int c = 7;

if (a % 2 == 0);
Console.WriteLine("Число четное");
if (a % 2 == 1);
Console.WriteLine("Число НЕчетное");
if (b % 2 == 0);
Console.WriteLine("Число четное");
if (b % 2 == 1);
Console.WriteLine("Число НЕчетное");
if (c % 2 == 0);
Console.WriteLine("Число четное");
if (c % 2 == 1);
Console.WriteLine("Число НЕчетное");



